/* Это объявление переменной, мы наши кнопку по тегу */
const button = document.querySelector('button');

/* Тут на кнопку навешиваем обрабочик, который ждёт клика и тогда запустит логику */
button.addEventListener('click', function() {
	alert('Деньги управляют миром\n\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️\nденьги деньги деньги❤️')
})